Revit 2027 API
BuiltInFailures.ViewSheetFailures.ViewOnASheetCannotBeUncropped3DPerspectiveView Property
 Sheets do not support uncropped perspective views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewOnASheetCannotBeUncropped3DPerspectiveView { get; }
Public Shared ReadOnly Property ViewOnASheetCannotBeUncropped3DPerspectiveView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewOnASheetCannotBeUncropped3DPerspectiveView {
	FailureDefinitionId^ get ();
}
static member ViewOnASheetCannotBeUncropped3DPerspectiveView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewSheetFailures Class
Autodesk.Revit.DB Namespace